// ========Task 1

//Напишіть код, який запитуватиме
//логін за допомогою prompt і логувати результат
//в консоль браузера

//Якщо відвідувач вводить "Адмін",
//то prompt запитує пароль.
//Якщо нічого не ввели або натиснута клавіша Esc
//Вивести стороку "Скасовано"
// Інакше вивести рядок "Я вас не знаю"

//Пароль перевіряти так:
//Якщо введено пароль "Я головний",
//то вивести рядок "Добрий день!"
//інакше виводити рядок "Невірний пароль!"

const checkLogin = function () {
  //логін за допомогою prompt

  const login = prompt("Введіть логін: ");

  if (login === "Адмін") {
    const password = prompt("Введіть пароль: ");

    if (password === "Я головний") {
      console.log("Добрий день!");
    } else {
      console.log("Невірний пароль!");
    }
  } else if (!login) {
    console.log("Скасовано");
  } else {
    console.log("Я вас не знаю");
  }
};

// checkLogin();

// ========== task 2

function min(a, b) {
  //   if (Math.min(a, b) === NaN) {
  //     return false;
  //   }

  //   return Math.min(a, b);

  let minNumber = a;
  if (b < a) {
    minNumber = b;
  }
  return minNumber;
}

console.log(min(13, 12));

// ===========Task 3

//Напишіть функцію caclculateAverage()
//яка приймає довільну кількість
//аргументів і повертає їхнє середнє значення.
//Додати перевірку, що аргументи це числа.

// ===========Task 4

//Напиши функцію findSmallerNumber(numbers)
//яка шукає найменше число в масиві.
//Додай перевірку що функція отримує масив
// const numbers = [2, 5, 35, 56, 12, 24, 7, 80, 3];

// ===========Task 5

//Напишіть функцію logItems(array), яка приймає
//масив та використовує цикл for, який для кожного
//елемента масиву виводитиме повідомлення у форматі
//<номер елемента> - <значення елемента>
//Нумерація елементів має починатися з першого.
//['Джаз', 'Блюз', 'Рок-н-рол', 'Реггі', 'Реп']

// ===========Task 6

// Створіть масив styles з елементами «Джаз» та «Блюз».
//Додайте "Рок-н-рол" в кінець.
// Замініть значення "Блюз" на "Класика".
//Видалить перший елемент масиву і виведіть його в консоль.
//Вставте «Реп» і «Реггі» на початок масиву.

// ===========Task 7

//Напиши функцію findLongestWord(string)
//яка приймає довільний рядок
//що складається лише з розділених слів
//пробілом (параметр string)
//і повертає найдовше слово у цьому рядку

// =============Task 8

//Напишіть функції для роботи з масивом
//add(name) додає курс до кінця колекції
//removeCourse(name) видаляє курс із колекції
//updateCourse(oldName, newName) змінює ім'я на нове
